MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC33EP512MC506/mcu.h
#define __FICD_BASE 0x557f0
#define __FICD_LENGTH 0x2

#define __FPOR_BASE 0x557f2
#define __FPOR_LENGTH 0x2

#define __FWDT_BASE 0x557f4
#define __FWDT_LENGTH 0x2

#define __FOSC_BASE 0x557f6
#define __FOSC_LENGTH 0x2

#define __FOSCSEL_BASE 0x557f8
#define __FOSCSEL_LENGTH 0x2

#define __FGS_BASE 0x557fa
#define __FGS_LENGTH 0x2

#define __FUID0_BASE 0x800ff8
#define __FUID0_LENGTH 0x2

#define __FUID1_BASE 0x800ffa
#define __FUID1_LENGTH 0x2

#define __FUID2_BASE 0x800ffc
#define __FUID2_LENGTH 0x2

#define __FUID3_BASE 0x800ffe
#define __FUID3_LENGTH 0x2

#define __DEVID_BASE 0xff0000
#define __DEVID_LENGTH 0x4

#define __SFRS_BASE 0x0
#define __SFRS_LENGTH 0x1000

#define __DATA_BASE 0x1000
#define __DATA_LENGTH 0xc000

#define __YDATA_BASE 0x9000
#define __YDATA_LENGTH 0x9000
#define __SFRS_BASE 0x0
#define __SFRS_LENGTH 0x1000

#define __DATA_BASE 0x1000
#define __DATA_LENGTH 0xc000

#define __YDATA_BASE 0x9000
#define __YDATA_LENGTH 0x9000
#define __SFRS_BASE 0x0
#define __SFRS_LENGTH 0x1000

#define __DATA_BASE 0x1000
#define __DATA_LENGTH 0xc000

#define __YDATA_BASE 0x9000
#define __YDATA_LENGTH 0x9000

/*
 * PPS Remapping Pin Names
 */

#define _RPOUT_U1TX 1
#define _RPOUT_U2TX 3
#define _RPOUT_SDO2 8
#define _RPOUT_SCK2OUT 9
#define _RPOUT_SS2OUT 10
#define _RPOUT_C1TX 14
#define _RPOUT_OC1 16
#define _RPOUT_OC2 17
#define _RPOUT_OC3 18
#define _RPOUT_OC4 19
#define _RPOUT_C1OUT 24
#define _RPOUT_C2OUT 25
#define _RPOUT_C3OUT 26
#define _RPOUT_PSYNCO1 45
#define _RPOUT_QEI1CCMP 47
#define _RPOUT_REFCLK 49
#define _RPOUT_C4OUT 50

#endif
